Ср {
  time = "11:30-13:00"
  weeks = "2, 4, 6, 8, 10, 12, 14, 16"
  group = "ИНФОРМ КСиТ 2"
  build = "ул.Ломоносова, д.9, лит. М"
  lesson = "Информатика (Лек) : Актовый зал"
  lessonFormat = "Очно - дистанционный"
}
Ср {
  time = "11:30-13:00"
  weeks = "2, 4, 6, 8, 10, 12, 14, 16"
  group = "ИНФОРМ СиППО 1"
  build = "ул.Ломоносова, д.9, лит. М"
  lesson = "Информатика (Лек) : Актовый зал"
  lessonFormat = "Очно - дистанционный"
}
Сб {
  time = "8:10-9:40"
  weeks = "6, 7, 8, 10, 11, 12, 13, 14"
  group = "PRLCOMP 1"
  build = "Кронверкский пр., д.49, лит.А"
  lesson = "Parallel Computing / Параллельные вычисления (Лек)"
  lessonFormat = "Очно - дистанционный"
}
Сб {
  time = "9:50-11:20"
  weeks = "6, 7, 8, 10, 11, 12, 13, 14"
  group = "PRLCOMP 1.1"
  build = "Кронверкский пр., д.49, лит.А"
  lesson = "Parallel Computing / Параллельные вычисления (Лаб)"
  lessonFormat = "Очно - дистанционный"
}
Сб {
  time = "11:30-13:00"
  weeks = "2, 4, 6, 8, 10, 12, 14, 16"
  group = "ИНФОРМ (Р3106) 1.1"
  build = "Кронверкский пр., д.49, лит.А"
  lesson = "Информатика (Лаб)"
  lessonFormat = "Очно - дистанционный"
}
Сб {
  time = "11:30-13:00"
  weeks = "3, 5, 7, 9, 11, 13, 15, 17"
  group = "ИНФОРМ (Р3107) 1.2"
  build = "Кронверкский пр., д.49, лит.А"
  lesson = "Информатика (Лаб)"
  lessonFormat = "Очно - дистанционный"
}
Сб {
  time = "13:30-15:00"
  weeks = "2, 4, 6, 8, 10, 12, 14, 16"
  group = "ИНФОРМ (Р3106) 1.1"
  build = "Кронверкский пр., д.49, лит.А"
  lesson = "Информатика (Лаб)"
  lessonFormat = "Очно - дистанционный"
}
Сб {
  time = "13:30-15:00"
  weeks = "3, 5, 7, 9, 11, 13, 15, 17"
  group = "ИНФОРМ (Р3107) 1.2"
  build = "Кронверкский пр., д.49, лит.А"
  lesson = "Информатика (Лаб)"
  lessonFormat = "Очно - дистанционный"
}
